reunion/app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-09-13 14:40:58.000000', '2011-09-13 14:40:58.000000')