reunion/app/controllers/line_items_controller.rb

SELECT "reunion_options".* FROM "reunion_options" WHERE "reunion_options"."id" = 4 ORDER BY category LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-09-14 06:52:24.467303', '2011-09-14 06:52:24.467303')
INSERT INTO "line_items" ("updated_at", "quantity", "created_at", "cart_id", "reunion_option_id", "order_id") VALUES ('2011-09-14 08:27:34.998429', 1, '2011-09-14 08:27:34.998429', 36, 3, NULL)
UPDATE "line_items" SET "updated_at" = '2011-09-13 16:20:33.223157', "quantity" = 2 WHERE "line_items"."id" = 2
---
  def create
    @cart = current_cart
    reunion_option = ReunionOption.find(params[:reunion_option_id])
    @line_item = @cart.add_reunion_option(reunion_option.id)

    respond_to do |format|
      if @line_item.save