reunion/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
      :per_page => 10

SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 24)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 24)
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-09-14 04:03:22.038041', '2011-09-14 04:03:22.038041')
INSERT INTO "orders" ("pay_type", "created_at", "address", "email", "name", "updated_at") VALUES ('Paypal', '2011-09-14 07:38:09.210741', 'leriofhebr', 'john.r.james67@gmail.com', 'John James', '2011-09-14 07:38:09.210741')
DELETE FROM "carts" WHERE "carts"."id" = 24
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 980190963)
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    logger.debug "New order: #{@order.attributes.inspect}"
    logger.debug "Order should be valid: #{@order.valid?}"

    respond_to do |format|
      if @order.save
    	flash[:notice] = 'Order was successfully created.'
        logger.debug "The order was saved and now the cart is going to be destroyed..."
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
	logger.debug "The cart session was destroyed and now the user will be notified..."
        Notifier.order_received(@order).deliver