reunion/app/controllers/reunion_store_controller.rb

SELECT "reunion_options".* FROM "reunion_options" ORDER BY category, created_at desc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "reunion_options"
---
  def index
   @reunion_options = ReunionOption.paginate :page=>params[:page], :order=>'created_at desc',
      :per_page => 3