reunion/app/controllers/reunion_options_controller.rb

SELECT "reunion_options".* FROM "reunion_options" ORDER BY category, created_at desc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "reunion_options"
---
  def index
    @reunion_options = ReunionOption.paginate :page=>params[:page], :order => 'created_at desc',
      :per_page => 3

SELECT "reunion_options".* FROM "reunion_options" WHERE "reunion_options"."id" = 980190962 ORDER BY category LIMIT 1
---
  def show
    @reunion_option = ReunionOption.find(params[:id])

SELECT "reunion_options".* FROM "reunion_options" WHERE "reunion_options"."id" = 980190962 ORDER BY category LIMIT 1
---
  def edit
    @reunion_option = ReunionOption.find(params[:id])

INSERT INTO "reunion_options" ("s_and_h_cost", "on_hand_quantity", "sale_price", "category", "option_item", "price", "note", "updated_at", "created_at", "color", "size", "store_initial_quantity", "image_url") VALUES (9.99, 1, 9.99, 'MyString', 'MyString', 9.99, 'MyText', '2011-09-13 12:38:40.000000', '2011-09-13 12:38:40.000000', 'MyString', 'MyString', 1, 'MyString')
---
  def create
    @reunion_option = ReunionOption.new(params[:reunion_option])

    respond_to do |format|
      if @reunion_option.save

SELECT "reunion_options".* FROM "reunion_options" WHERE "reunion_options"."id" = 980190962 ORDER BY category LIMIT 1
---
  def update
    @reunion_option = ReunionOption.find(params[:id])

SELECT "reunion_options".* FROM "reunion_options" WHERE "reunion_options"."id" = 980190962 ORDER BY category LIMIT 1
DELETE FROM "reunion_options" WHERE "reunion_options"."id" = 980190962
---
  def destroy
    @reunion_option = ReunionOption.find(params[:id])
    @reunion_option.destroy